/* Вопросы с ответами и изменение счета */
const questions = [
    [
        " Ваша улюблена планета у галактиці StarCraft",
        ["Слейн", "Айур", "Чар", "Мар-Сара", "Зерус"],
        [
            "this.score.taldarim++",
            "this.score.protoss++",
            "this.score.zerg++",
            "this.score.terran++",
            "this.score.primal++"
        ]
    ],
    [
        "Я річка…",
        ["А я зірковий мисливець", "Вороги уламки, що пливуть", "Ти моє море"],
        [
            "this.score.protoss++; this.score.terran--",
            "this.score.primal++; this.score.protoss--; this.score.terran--",
            "this.score.terran++; this.score.protoss--"
        ]
    ],
    [
        "З ким ви поговорите на списі Адуна?",
        ["З Абатуром", "З Свонном", "З Караксом"],
        [
            "this.score.protoss--",
            "this.score.protoss--",
            "this.score.protoss++"
        ]
    ],

    [
        "Перед вами добре укріплений теранський бункер",
        ["Я асимілюю есенцію тиранозора, який мешкає в цих місцях та еволюціоную", "Запрошу орбітальний удар якщо вони перші проявлять агресію"],
        [
            "this.score.primal++; this.score.protoss--; this.score.terran--", 
            "this.score.protoss++; this.score.terran--", 
            "this.score.terran++; this.score.protoss--"
        ]
    ],
    [
        "Як щодо звалити зі мною, ковбой?",
        ["Чорт, давно час", "Давай зі мною", "Без питаннь"],
        [
            "this.score.terran++"
        ]
    ],
    [
        "На вас напали",
        ["Нам потрібні роєвики, споровики и сплетники", "Потрібно викликати кайдаринові моноліти та фотонні гармати", "Звести планетарну фортецю, бункери та підвести облогові танки"],
        [
            "this.score.zerg+=2; this.score.protoss--; this.score.terran--", 
            "this.score.protoss++; this.score.terran--; this.score.zerg-=2", 
            "this.score.terran++; this.score.protoss--; this.score.zerg-=2"
        ]
    ],
    [
        "Королева наказує вам обрушити свій гнів на світи домініону",
        ["Повинен підкоритися", "Поки вона збирає, я слідую", "Її псійна сила на мене не діє"],
        [
            "this.score.zerg++; this.score.protoss--", 
            "this.score.primal++; this.score.protoss--", 
            "this.score.protoss++; this.score.zerg--"
        ]
    ],
    [
        "Перед вами вищий тамплієр",
        ["Сильна есенція, але я не можу її зібрати", "Знищити протосів", "Стати архонтом", "Спитати як справи у Артаніса"],
        [
            "this.score.primal++; this.score.protoss--; this.score.terran--", 
            "this.score.zerg++; this.score.protoss--; this.score.terran--", 
            "this.score.protoss++; this.score.terran--; this.score.zerg--", 
            "this.score.terran++; this.score.protoss--; this.score.zerg--"
        ]
    ],
    [
        "Ви помітили морпіха який не підкоряється вашому наказу",
        ["Знищити мімікріду", "Зробити йому догану"],
        [
            "this.score.terran++", 
            "this.score.terran--"
        ]
    ],
    [
        "На вас рухається зграя саранчидів",
        ["Багато есенції можна зібрати", "Наказати їм летіти далі", "Спробувати знищити феніксами поки вони в повітрі"],
        [
            "this.score.primal++; this.score.protoss--", 
            "this.score.zerg++; this.score.protoss--", 
            "this.score.protoss++; this.score.zerg--"
        ]
    ],
    [
        "Ви бачите початковий вир народження, що ви зробите?",
        ["Зберу багато есенції", "Моє тіло не витримає такої сили", "Спробую знищити це місце"],
        [
            "this.score.primal++; this.score.protoss--", 
            "this.score.zerg++; this.score.protoss--", 
            "this.score.protoss++; this.score.zerg--"
        ]
    ],
    [
        "Ви сильно втомилися сьогодні",
        ["Піду в бар у Джорея", "Рій не знає втоми", "Слабкі, впадуть першими"],
        [
            "this.score.terran++; this.score.zerg--", 
            "this.score.zerg++; this.score.terran--", 
            "this.score.taldarim++; this.score.terran--; this.score.zerg--"
        ]
    ],
    [
        "Перед вами ієрарх протосів",
        ["Викликати на Рак-шир", "Привітати фразою «Ен Таро Тассадар»", "Відправити рій в атаку"],
        [
            "this.score.taldarim++; this.score.zerg--", 
            "this.score.protoss++; this.score.zerg--", 
            "this.score.zerg++; this.score.protoss--"
        ]
    ],
    [
        "Зератул та Воразун",
        ["Пов'язані Кхалою", "Чоловік и дружина", "Темні тамплієри", "Новий вид зергів"],
        [
            "this.score.protoss--", 
            "this.score.protoss-=2", 
            "this.score.protoss++", 
            "this.score.protoss-=3"
        ]
    ],
    [
        "У цих місцях багато джерел терразин",
        ["Захищати родовища від інопланетних загарбників", "Добути якнайбільше, поки ці Талдаримські живчики не встигли нічого зрозуміти"],
        [
            "this.score.taldarim++; this.score.terran--", 
            "this.score.terran++"
        ]
    ],
    [
        "У лабораторії ставлять досліди над бруталіском",
        ["Бруталіск - вершина еволюції, потрібен рою", "Поцікавитись у хлопців, що цікавого вони дізналися", "Бруталіск дуже небезпечний краще знищити його разом із теранською лабораторією"],
        [
            "this.score.zerg++; this.score.protoss--; this.score.terran--", 
            "this.score.terran++; this.score.protoss--; this.score.zerg--", 
            "this.score.protoss++; this.score.terran--; this.score.zerg--"
        ]
    ],
    [
        "Як звуть Свонна?",
        ["Габріель", "Джеймс", "Рорі"],
        [
            "this.score.terran--", 
            "this.score.terran--", 
            "this.score.terran++"
        ]
    ],
    [
        "Фенікс - ",
        ["Тамплієр", "Неразім", "Чистильник", "Талдарім"],
        [
            "this.score.protoss--", 
            "this.score.protoss--", 
            "this.score.protoss++", 
            "this.score.protoss--"
        ]
    ],
    [
        "Вам необхідно наздогнати материнський корабель протосів",
        ["Використовую гіперстрибок", "Перехоплю його, впровадивши паразит", "Відправлю човник з посланням"],
        [
            "this.score.terran++; this.score.zerg--; this.score.protoss--", 
            "this.score.zerg++; this.score.protoss--; this.score.terran--", 
            "this.score.protoss++; this.score.terran--; this.score.zerg--"
        ]
    ],
    [
        "Зергі заразили командні центри Вірофагамі",
        ["Потрібно знищити всіх, щоб епідемія не поширилася", "Спалити тільки заражені будови та врятувати якнайбільше людей"],
        [
            "this.score.protoss++; this.score.terran--", 
            "this.score.terran++; this.score.protoss--"
        ]
    ],
    [
        "Порожнеча…",
        ["Найкращий друг людини", "Холодна"],
        [
            "this.score.protoss--", 
            "this.score.protoss++"
        ]
    ],
    [
        "Як ви привітаєте Джеймса Рейнора",
        ["Друг Рейнор", "Привіт, ковбоє", "Мені потрібна твоя есенція"],
        [
            "this.score.protoss++; this.score.terran--", 
            "this.score.terran++; this.score.protoss--", 
            "this.score.primal++; this.score.protoss--; this.score.terran--"
        ]
    ],
    [
        "Ви зібрали багато кредитів на продаж теразину",
        ["Найняти найкращих головорізів домініону", "Удосконалити технології", "Надіслати їх до фонду Мебіуса для вивчення гібридів"],
        [
            "this.score.terran++", 
            "this.score.terran+=2", 
            "this.score.terran--"
        ]
    ],
    [
        "Амун збирається знищити Айур",
        ["Допомогти протосам у битві", "Послати човники на Шакурас и запросити допомогу Золотої Армади", "Викликати Флот Смерті и дати Амуну бій"],
        [
            "this.score.terran++; this.score.protoss--", 
            "this.score.protoss++; this.score.zerg--", 
            "this.score.taldarim++; this.score.zerg--"
        ]
    ],
    [
        "Навіщо ви прилетіли на Чар?",
        ["Вистежити и вбити королеву клинків", "Знайти Керріган и переконати повернутися на Мар-Сару", "Скупатися в слизу"],
        [
            "this.score.protoss++; this.score.terran--; this.score.zerg-=2", 
            "this.score.terran++; this.score.protoss--; this.score.zerg-=2", 
            "this.score.zerg+=2; this.score.protoss--; this.score.terran--"
        ]
    ]
];
/* Данные для экранов резултата для каждой расы */
const results = {
    'zerg': {
        name: "Зерг",
        description: "Ви справжній зерг, чистота есенції та служіння на славу роя – це ваше призначення. Ваша зграя захопила безліч світів та тепер рій став ще сильнішим. Королева Клінков задоволена вами, продовжуйте та надалі служити їй. Ви поважаєте протоси, але не вважаєте, що у них є шанс зберегтися як вид. Адже вони не можуть еволюціонувати та в масштабах всесвіту їхня раса приречена на вимирання. Терани це біомаса, їхня есенція може бути асимільована та використана на благо рою.",
        quote1: "-Поняття досконалості розтяжне. Можна прагнути, неможливо досягти. Досконалість, як мета, не має сенсу.",
        quote2: "-Смерть не має значення, важлива лише есенція",
        author: "(Абатур)",
        points: "100"
    },
    'primal': {
        name: "Початковий зерг",
        description: "Все, що вас цікавить - це Есенція, чим її більше тим краще для вас. Ви еволюціонуєте, адаптуєтеся та підлаштовуєтеся під довкілля. Немає таких проблем, які ви не вирішите. Завдяки постійному збору есенції ви можете у будь-який момент змінитись. Есенція це ваш спосіб життя. Так багато видів есенції. Сотні видів. З кожним роком дедалі більше. Потрібно її зібрати.",
        quote1: "-Мені потрібна есенція. Есенція це життя. Я жити без неї не можу.",
        quote2: "",
        author: "(Дехака)",
        points: "120"
    },
    'terran': {
        name: "Терран",
        description: "Вас не цікавлять проблеми протосів та зергів, вічна ворожнеча та спустошення світів. Кривавий слід, який тягнеться з незапам'ятних часів за цими ворогуючими расами торкається та теранів, як би сильно ви не намагалися не втручатися. Уникнути контакту з протосами не вдалося, але з ними можна домовитися на відміну від зергів. Прості людські радощі прикрашають ваше життя. Спілкування з друзями, похід до бару з гарною музикою, відпочинок на природі. Що ще потрібне людині.",
        quote1: "-Не зв'язуйтесь з хлопцями із Мар-Сари.",
        quote2: "",
        author: "(Рейнор)",
        points: "90"
    },
    'infested': {
        name: "Заражений терран",
        description: "Зважаючи на все вас заразили зерги, тепер ви служите рою. Але це не заважає вам мріяти про помсту зергам.",
        quote1: "-Заражені завжди піднімаються знову.",
        quote2: "-Коли ОЗД повернеться до сектора, від вас нічого не залишиться.",
        author: "(Стуков)",
        points: "160"
    },
    'protoss': {
        name: "Протосс",
        description: "Ви горді та бездоганні. Честь веде вас крізь вир неприємностей, які підстерігають ваш народ з часів війни зі Надрозумом. За Айур ви готові битися до смерті. Усі протоси прагнуть бути схожими на вас. У вашого народу вічна ворожнеча із зергами, очищати світи від їхньої скверни та знищувати вулик за вуликом ось що є вашою першорядною метою. Поки зерги не буде знищено, протоси не зможуть спати спокійно.",
        quote1: "-Сила в єдності.",
        quote2: "",
        author: "(Артанис)",
        points: "80"
    },
    'taldarim': {
        name: "Талдарим",
        description: "У минулі часи ви служили Амуну, що загинув Зел-Нага, зараз же ваш народ набув свободи. Після того як Аларак став владикою талдаримів, перемігши Малаша в поєдинку Рак-Шир, він не просто змінив свій статус у ланцюзі піднесення, а й привів талдаримів до мирного співіснування з іншими народами протосів. Тепер можна відновлювати свої світи як єдиний сильний народ. Ваші навички будуть дуже корисні у цій непростій задачі.",
        quote1: "-Ти Розмовляєш з владикою.",
        quote2: "-Як ти можеш мені послужити?",
        author: "(Аларак)",
        points: "140"
    },
    'hybrid': {
        name: "Гібрид",
        description: "Чистота форми та чистота есенції присутня у вашому організмі. Ви одна з небагатьох істот, яких прагнули створити Зел-Нага. Доктор Наруд зумів втілити всі плани Зел-Нага в життя та тепер ви є ідеальним знаряддям. Не дивлячись на те, що ви гібрид зерга та протоса ви не відчуваєте симпатії до цих рас, а вважаєте найвищою расою Гібридів.",
        quote1: "-Все тільки починається. Амун шепотів про це з далеких зірок.",
        quote2: "",
        author: "(Наруд)",
        points: "200"
    }
}